<a href="https://colab.research.google.com/github/adukeshav2021/Anly_560/blob/main/Lab6_R.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [35]:
library(dplyr)
library(tidyr)
library(stringr)
library(lubridate)

Warning message in system("timedatectl", intern = TRUE):
“running command 'timedatectl' had status 1”

Attaching package: ‘lubridate’


The following objects are masked from ‘package:base’:

    date, intersect, setdiff, union

In [4]:
religion <- read.csv('/content/lab6.religion.csv')

In [7]:
colnames(religion) <- c('religion', '<$10k', '$10-20k', '$20-30k', '$30-40k', '$40-50k', '$50-75k'
)

In [8]:
head(religion)
str(religion)

  religion           <$10k $10-20k $20-30k $30-40k $40-50k $50-75k
1 Agnostic            27    34       60     81      76      137
2 Atheist             12    27       37     52      35       70
3 Buddhist            27    21       30     34      33       58
4 Catholic           418   617      732    670     638     1116
5 Don't know/refused  15    14       15     11      10       35
6 Evangelical Prot   575   869     1064    982     881     1486

'data.frame':	10 obs. of  7 variables:
 $ religion: chr  "Agnostic" "Atheist" "Buddhist" "Catholic" ...
 $ <$10k   : int  27 12 27 418 15 575 1 228 20 19
 $ $10-20k : int  34 27 21 617 14 869 9 244 27 19
 $ $20-30k : int  60 37 30 732 15 1064 7 236 24 25
 $ $30-40k : int  81 52 34 670 11 982 9 238 24 25
 $ $40-50k : int  76 35 33 638 10 881 11 197 21 30
 $ $50-75k : int  137 70 58 1116 35 1486 34 223 30 95

In [ ]:
religion[,c(1,2)]

In [ ]:
r1 <- religion[,c(1,2)]
r2 <- religion[,c(1,3)]
r3 <- religion[,c(1,4)]
r4 <- religion[,c(1,5)]
r5 <- religion[,c(1,5)]
r6 <- religion[,c(1,7)]
r1$income <- '<$10k'
r2$income <- '$10-20k'
r3$income <- '$20-30k'
r4$income <- '$30-40k'
r5$income <- '$40-50k'
r6$income <- '$50-75k'
colnames(r1) <- c('religion','freq','income')
colnames(r2) <- c('religion','freq','income')
colnames(r3) <- c('religion','freq','income')
colnames(r4) <- c('religion','freq','income')
colnames(r5) <- c('religion','freq','income')
colnames(r6) <- c('religion','freq','income')
religion2 <-rbind(r1,r2,r3,r4,r5,r6)
religion2

In [17]:
religion3 <-
  religion %>%
  pivot_longer(contains('$'),names_to = 'income', values_to = 'freq')

In [ ]:
head(religion3)
str(religion3)

In [ ]:
religion3[19:31,]

In [20]:
tb <- read.csv('/content/lab6.tb.csv')

In [ ]:
head(tb)
str(tb)

In [22]:
tb2 <-
  tb %>%
  pivot_longer(matches('m|f'),names_to = 'column', values_to = 'freq')

In [ ]:
head(tb2)
str(tb2)

In [ ]:
tb2[tb2$column == 'mu',]
tb2[tb2$column == 'f014',]

In [ ]:
tb2 %>%
  mutate(
    sex = str_sub(column,1,1),
    age_range = str_sub(column,2),
    column = NULL
  )

In [29]:
temp <- read.csv('/content/lab6.temp.csv')

In [32]:
head(temp)
str(temp)

  id      date       element value
1 MX17004 2010-01-30 tmax    27.8
2 MX17004 2010-01-30 tmin    14.5
3 MX17004 2010-02-02 tmax    27.3
4 MX17004 2010-02-02 tmin    14.4
5 MX17004 2010-02-03 tmax    24.1
6 MX17004 2010-02-03 tmin    14.4

'data.frame':	10 obs. of  4 variables:
 $ id     : chr  "MX17004" "MX17004" "MX17004" "MX17004" ...
 $ date   : chr  "2010-01-30" "2010-01-30" "2010-02-02" "2010-02-02" ...
 $ element: chr  "tmax" "tmin" "tmax" "tmin" ...
 $ value  : num  27.8 14.5 27.3 14.4 24.1 14.4 29.7 13.4 29.9 10.7

In [33]:
temp2 <-
temp %>%
  pivot_wider(names_from = 'element',values_from = 'value')

In [ ]:
head(temp2)
str(temp2)

In [36]:
temp3 <-
  temp2 %>%
    mutate(date = ymd(date))

In [37]:
head(temp3)
str(temp3)

  id      date       tmax tmin
1 MX17004 2010-01-30 27.8 14.5
2 MX17004 2010-02-02 27.3 14.4
3 MX17004 2010-02-03 24.1 14.4
4 MX17004 2010-02-11 29.7 13.4
5 MX17004 2010-02-23 29.9 10.7

tibble [5 × 4] (S3: tbl_df/tbl/data.frame)
 $ id  : chr [1:5] "MX17004" "MX17004" "MX17004" "MX17004" ...
 $ date: Date[1:5], format: "2010-01-30" "2010-02-02" ...
 $ tmax: num [1:5] 27.8 27.3 24.1 29.7 29.9
 $ tmin: num [1:5] 14.5 14.4 14.4 13.4 10.7